app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-02-07 23:02:24.443133"], ["updated_at", "2019-02-07 23:02:24.443133"]]
---
  def create
    @schoolclass = SchoolClass.new(school_class_params(:title, :room_number))
    @schoolclass.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-02-08 14:49:18.521602"], ["id", 1]]
---
  def update
  	@schoolclass = SchoolClass.find(params[:id])
  	@schoolclass.update(school_class_params(:title))